## OpenTofu plan (dns)

<details>
<summary>Show plan</summary>

```terraform

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_record.onprem_cname_records["idrac1"] will be created
  + resource "digitalocean_record" "onprem_cname_records" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "idrac1"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "onprem.login.no."
    }

  # digitalocean_record.onprem_cname_records["idrac2"] will be created
  + resource "digitalocean_record" "onprem_cname_records" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "idrac2"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "onprem.login.no."
    }

  # digitalocean_record.onprem_cname_records["idrac3"] will be created
  + resource "digitalocean_record" "onprem_cname_records" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "idrac3"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "onprem.login.no."
    }

  # digitalocean_record.onprem_cname_records["pve1"] will be created
  + resource "digitalocean_record" "onprem_cname_records" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "pve1"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "onprem.login.no."
    }

  # digitalocean_record.onprem_cname_records["pve2"] will be created
  + resource "digitalocean_record" "onprem_cname_records" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "pve2"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "onprem.login.no."
    }

  # digitalocean_record.onprem_cname_records["truenas"] will be created
  + resource "digitalocean_record" "onprem_cname_records" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "truenas"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "onprem.login.no."
    }

  # digitalocean_record.onprem_mgmt_record will be created
  + resource "digitalocean_record" "onprem_mgmt_record" {
      + domain = "login.no"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "onprem"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "128.39.140.144"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>